{ "collections": [ { "id": 1, "name": "git" }, { "id": 2, "name": "javascript" } ], "items": [ { "collectionId": 1, "id": 1, "name": "2rebase <base>", "definition": "Rebase the current branch onto <base>. <base> can be a commit ID, branch name, a tag, or a relative reference to HEAD" }, { "collectionId": 1, "id": 2, "name": "cherry-pick <commit>", "definition": "Cherry picking is the act of picking a commit from a branch and applying it to another" }, { "collectionId": 1, "id": 3, "name": "merge <branch>", "definition": "Merge <branch> into the current branch" }, { "collectionId": 1, "id": 4, "name": "revert <commit>", "definition": "Create new commit that undoes all of the changes made in <commit>, then apply it to the current branch" }, { "collectionId": 1, "id": 5, "name": "reset <file>", "definition": "Remove <file> from the staging area, but leave the working directory unchanged. This unstages a file without overwriting any changes" }, { "collectionId": 1, "id": 6, "name": "commit --amend", "definition": "Option --amend allows take the most recent commit and add new staged changes to it" }, { "collectionId": 2, "id": 7, "name": "polyfill", "definition": "A polyfill is a piece of code (usually JavaScript on the Web) used to provide modern functionality on older browsers that do not natively support it" }, { "collectionId": 2, "id": 8, "name": "property descriptor", "definition": "A property descriptor is a record with some of the following attributes: value, writable, get, set, configurable, enumerable" }, { "collectionId": 2, "id": 9, "name": "immutability", "definition": "Immutables are the objects whose state cannot be changed once the object is created. Strings and Numbers are Immutable" }, { "collectionId": 2, "id": 10, "name": "reference", "definition": "The references are pointers to values stored in variables and NOT pointers to other variables, or references" }, { "collectionId": 2, "id": 11, "name": "promise", "definition": "A promise is an object that may produce a single value some time in the future : either a resolved value, or a reason that it's not resolved (e.g., a network error occurred). A promise may be in one of 3 possible states: fulfilled, rejected, or pending" }, { "collectionId": 2, "id": 12, "name": "callback", "definition": "Callback is a function which is to be executed after another function has finished execution" } ] }